var chartDom = document.getElementById('down');
var myChart = echarts.init(chartDom);
var option;

option = {
  xAxis: {
    type: 'category',
    // 修正并扩展x轴标签至19个点
    data: [
      '1',
      '2',
      '3',
      '4',
      '5',
      '6',
      '7',
      '8',
      '9',
      '10',
      '11',
      '12',
      '13',
      '14',
      '15',
      '16',
      '17',
      '18',
      '19'
    ]
  },
  yAxis: {
    type: 'value'
  },
  series: [
    {
      // 使用归一化后的gamma值作为数据
      data: [
        0.0762806176, 0.3612349296, 0.5760110823, 0.5156947567, 0.1351937293,
        0.0, 0.2995017312, 1.0, 0.3021430089, 0.4604375125, 0.4276017354,
        0.2325999535, 0.8050153568, 0.0024487538, 0.6489660118, 0.1238124526,
        0.1859692821, 0.545062463, 0.0764882791
      ],
      type: 'line'
    }
  ]
};

option && myChart.setOption(option);
